In [4]:
import pandas as pd

In [7]:
df1 = pd.DataFrame({'NOMBRE':['Jairo', 'juvel'],
                    'CARRERA':['Programcion', 'diseño'],
                    'EDAD':['28', '26']}).set_index('NOMBRE')

In [6]:
df2 = pd.DataFrame({'NOMBRE':['sara', 'monica'],
                    'CARRERA':['derecho', 'ventas'],
                    'EDAD':['22', '24']}).set_index('NOMBRE')

In [9]:
df = pd.concat([df1,df2])

In [10]:
df

            CARRERA EDAD
NOMBRE
Jairo   Programcion   28
juvel        diseño   26
sara        derecho   22
monica       ventas   24